In [1]:
import pandas as pd

In [2]:
sampledt = pd.Series([0,10,20,30,40,50,60,70,80,90])
sampledt

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [3]:
sampledt2 = pd.Series([0,10,20,30,40,50,60,70,80,90],
                     index=['a','b','c','d','e','f','g','h','i','j'])
sampledt2

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [4]:
print(sampledt.values)
print(sampledt2.index)

[ 0 10 20 30 40 50 60 70 80 90]
Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [5]:
data = {'ID':['100','101','102','103','104'],
             'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
              'Birth_year':[1990,1989,1992,1997,1982],
              'Name':['Hiroshi','Akiko','Yuki','Satoru', 'Steve']
             }
data

{'ID': ['100', '101', '102', '103', '104'],
 'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
 'Birth_year': [1990, 1989, 1992, 1997, 1982],
 'Name': ['Hiroshi', 'Akiko', 'Yuki', 'Satoru', 'Steve']}

In [7]:
data_frame = pd.DataFrame(data)
data_frame

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [9]:
data_frame_index = pd.DataFrame(data, index=['a','b','c','d','e'])
data_frame_index

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [10]:
data_frame_index.T

                  a      b      c         d      e
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [11]:
data_frame_index.Birth_year

a    1990
b    1989
c    1992
d    1997
e    1982
Name: Birth_year, dtype: int64

In [14]:
data_frame_index[['ID', 'Birth_year']]

    ID  Birth_year
a  100        1990
b  101        1989
c  102        1992
d  103        1997
e  104        1982

In [16]:
data_frame_index[data_frame_index['City'] == 'Tokyo']

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
e  104  Tokyo        1982    Steve

In [17]:
data_frame_index[data_frame_index['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
b  101  Osaka        1989    Akiko
e  104  Tokyo        1982    Steve

In [19]:
data_frame_index[data_frame_index['Birth_year']<1990]

    ID   City  Birth_year   Name
b  101  Osaka        1989  Akiko
e  104  Tokyo        1982  Steve

In [23]:
data_frame.drop(0, axis = 0)

    ID      City  Birth_year    Name
1  101     Osaka        1989   Akiko
2  102     Kyoto        1992    Yuki
3  103  Hokkaido        1997  Satoru
4  104     Tokyo        1982   Steve

In [27]:
data_frame.drop(['Name', 'City'], axis = 1)

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [31]:
data2 = {'ID':['100','101','102','105','107'],
        'Math':[50,43,33,76,98],
        'English':[90,30,20,50,30],
        'Sex':['M','F','F','M','M']}
data_frame2 = pd.DataFrame(data2)
data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [32]:
pd.merge(data_frame, data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

In [33]:
data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [34]:
data_frame2.groupby('Sex')['English'].max()

Sex
F    30
M    90
Name: English, dtype: int64

In [37]:
data_frame2.English.sort_values()

2    20
1    30
4    30
3    50
0    90
Name: English, dtype: int64